{'2','Last Stop on Market Street',NULL,'Matt de la Peña','','A young boy rides the bus across town with his grandmother and learns to appreciate the beauty in everyday things. By the author of the celebrated picture book A Nation\'s Hope: The Story of Boxing Legend Joe Louis.','http://books.google.com/books/content?id=NS3eDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api','','399257748','2015-01-01','www.google.com','2020-07-11 15:54:37','2020-07-11 15:55:10','1'},
{'3','Hair Love',NULL,'Matthew A. Cherry','','A little girl\'s daddy steps in to help her arrange her curly, coiling, wild hair into styles that allow her to be her natural, beautiful self.','http://books.google.com/books/content?id=jjGgDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api','','525553363','2019-05-14','www.google.com','2020-07-11 16:05:08','2020-07-11 17:26:19','1'},
{'4','The Giving Tree',NULL,'Shel Silverstein','','\'Once there was a tree...and she loved a little boy.\' So begins a story of unforgettable perception, beautifully written and illustrated by the gifted and versatile Shel Silverstein. Every day the boy would come to the tree to eat her apples, swing from her branches, or slide down her trunk...and the tree was happy. But as the boy grew older he began to want more from the tree, and the tree gave and gave and gave. This is a tender story, touched with sadness, aglow with consolation. Shel Silverstein has created a moving parable for readers of all ages that offers an affecting interpretation of the gift of giving and a serene acceptance of another\'s capacity to love in return. Ages 10+','http://books.google.com/books/content?id=dXLWAAAAMAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api','','2147483647','1964-10-07','www.google.com','2020-07-11 16:13:16','2020-07-11 17:54:14','1'},
{'6','We March',NULL,'Shane W. Evans','','On August 28, 1963, a remarkable event took place--more than 250,000 people gathered in our nation\'s capital to participate in the March on Washington for Jobs and Freedom. The march began at the Washington Monument and ended with a rally at the Lincoln Memorial, where Martin Luther King Jr. delivered his historic \"I Have a Dream\" speech, advocating racial harmony. Many words have been written about that day, but few so delicate and powerful as those presented here by award-winning author and illustrator Shane W. Evans. When combined with his simple yet compelling illustrations, the thrill of the day is brought to life for even the youngest reader to experience. We March was one of Kirkus Reviews\' Best Children\'s Books of 2012, and is an important story about the African American civil rights movement.','http://books.google.com/books/content?id=QUZYrgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api','','1250073251','2016-01-12','www.google.com','2020-07-11 17:28:40','2020-07-11 17:28:51','1'},
{'7','Mommy, Mama, and Me',NULL,'Leslǎ Newman','','A baby drinks juice, plays in the park, reads, and gets put to bed by her two loving mothers. On board pages.','http://books.google.com/books/content?id=ya43c7n_MloC&printsec=frontcover&img=1&zoom=1&source=gbs_api','','1582462631','2009-01-01','www.google.com','2020-07-11 17:33:43','2020-07-11 17:33:54','1'},
{'8','Harlem\'s Little Blackbird','','Renee Watson','','A tribute to Harlem Renaissance performer Florence Mills covers her youth as a child of former slaves, her performances that inspired songs and entire plays, and the racism that prompted her advocacy of all-black theater and musicals.','http://books.google.com/books/content?id=VF87GaEHgjsC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api','','375869730','2012-10-23','','2020-07-13 22:17:00','2020-07-13 22:18:37','1'},
{'9','Yes I Can!','A Girl and Her Wheelchair','Kendra J. Barrett','','\"Carolyn is in a wheelchair, but she doesn\'t let that stop her! She can do almost everything the other kids can, even if sometimes she has to do it a little differently\"--','http://books.google.com/books/content?id=EJheswEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api','Ask your child \nWhat would you do to support another kid whose feelings are hurt?\nHow can you be kind to other kids in general? Kids with differing abilities?\nHow can we change games to make it so a friend in a wheelchair can play?\n','1433828690','2018-11-20','https://www.youtube.com/watch?v=nTQpK9PGU5w','2020-07-14 02:59:08','2020-07-14 03:04:23','1'},
{'11','Say Something','','Peter H. Reynolds','Peter H. Reynolds','From the creator of the New York Times bestseller The Word Collector comes an empowering story about finding your voice, and using it to make the world a better place.','http://books.google.com/books/content?id=mrOVtgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api','','545865036','2019-02-26','https://www.youtube.com/watch?v=MOsaBQoDr1w','2020-07-14 03:03:34','2020-07-14 15:31:41','1'},
{'13','What\'s My Superpower?','','Aviaq Johnston','Tim Mack','Nalvana feels like all of her friends have some type of superpower. She has friends with super speed (who always beat her in races), friends with super strength (who can dangle from the monkey bars for hours), and friends who are better than her at a million other things. Nalvana thinks she must be the only kid in town without a superpower. But then her mom shows Nalvana that she is unique and special, and that her superpower was right in front of her all along.','http://books.google.com/books/content?id=ykROvgAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api','','1772271409','2017-06-21','https://www.youtube.com/watch?v=T9LZPF4hGgM','2020-07-14 20:49:58','2020-07-14 21:03:41','1'},
{'15','The Girl and the Wolf','','Katherena Vermette','','This picture book for young children is an empowering Indigenous twist on a classic wolf narrative.','http://books.google.com/books/content?id=EhqnugEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api','','1926886541','2019-02-05','https://www.youtube.com/watch?v=Z9Gk0fonViU','2020-07-14 20:50:55','2020-07-14 21:16:10','1'},
{'16','A Tale of Two Mommies','','Vanita Oelschlager','Mike Blanc','A young boy describes how his two mothers take care of him, from fishing, to coaching t-ball, to comforting him when he is upset.','http://books.google.com/books/content?id=XUiiuAAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api','','982636671','2011-09-01','https://www.youtube.com/watch?v=g_li-Y6azeo','2020-07-14 20:52:32','2020-07-14 21:02:40','1'},
{'17','A Princess of Great Daring','','Tobi Hill-Meyer','Elenore Toczynski','\"When Jamie is ready to tell people that she\'s really a girl inside, she becomes a princess of great daring in a game she plays with her best friends to gather her courage. She\'s pleased (but not surprised) that her questing friends turn out to be just as loyal and true as any princess could want.\"--Page 4 of cover.','http://books.google.com/books/content?id=m4Z4jwEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api','','987976352','2015-01-15','https://www.youtube.com/watch?v=soRLW5GX3nY','2020-07-14 20:53:27','2020-07-14 21:02:27','1'},
{'18','It Feels Good to Be Yourself','A Book About Gender Identity','Theresa Thorn','Noah Grigni','Some people are boys. Some people are girls. Some people are both, neither, or somewhere in between. This sweet, straightforward exploration of gender identity will give children a fuller understanding of themselves and others. With child-friendly language and vibrant art, It Feels Good to Be Yourself provides young readers and parents alike with the vocabulary to discuss this important topic with sensitivity.','http://books.google.com/books/content?id=7jNwDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api','','1250302953','2019-05-14','https://www.youtube.com/watch?v=Ny0wjj8t2X8','2020-07-14 20:53:50','2020-07-14 21:05:52','1'},
{'19','This Day in June','','Gayle E. Pitman','Kristyna Litten ','\"A picture book illustrating a Pride parade. The endmatter serves as a primer on LGBT history and culture and explains the references made in the story\"--','http://books.google.com/books/content?id=2hDcjwEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api','','1433816598','2014-05-12','https://www.youtube.com/watch?v=rYTXAwAUhUc','2020-07-14 20:54:43','2020-07-14 21:03:25','1'},
{'20','When Aidan Became a Brother','','Kyle Lukoff','Kaylani Juanita ','\"Aidan, a transgender boy, experiences complicated emotions as he and his parents prepare for the arrival of a new baby\"--','http://books.google.com/books/content?id=2UfDvAEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api','','1620148372','2019-06-04','https://www.youtube.com/watch?v=ALfMX_SrRRw','2020-07-14 20:55:25','2020-07-14 21:02:15','1'},
{'21','The Gaybcs','','M. L. Webb','','A joyous, timely alphabet book of LGBTQ+ vocabulary, celebrating the beauty of embracing one\'s true self. In this inclusive book of ABCs, four friends play and exploreduring a playdate extravaganza. As they sashay out of closetsand discover a wardrobe fit for a king or queen, they realize that manyproblems can be solved with a little makeup, imagination, and,of course, your best friends! Featuring bright illustrations and upbeat, accessible poems,The GayBCsis perfect for fans ofA Is for ActivistandFeminist Baby-showing kids and adults alikethat every identity is worthy of being celebrated.','http://books.google.com/books/content?id=A2GqDwAAQBAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api','','1683691624','2019-06-04','https://www.youtube.com/watch?v=Qs8iqxfxib4','2020-07-14 20:56:57','2020-07-14 21:03:08','1'},
{'22','Who Are You?','The Kid\'s Guide to Gender Identity','Brook Pessin-Whedbee','Naomi Bardoff ','What do you like? How do you feel? Who are you? This brightly illustrated children\'s book provides a straightforward introduction to gender for anyone aged 3+. It presents clear and direct language for understanding and talking about how we experience gender: our bodies, our expression and our identity. An interactive three-layered wheel included in the book is a simple, yet powerful, tool to clearly demonstrate the difference between our body, how we express ourselves through our clothes and hobbies, and our gender identity. Ideal for use in the classroom or at home, a short page-by-page guide for adults at the back of the book further explains the key concepts and identifies useful discussion points. This is a one-of-a-kind resource for understanding and celebrating the gender diversity that surrounds us.','http://books.google.com/books/content?id=OhyZDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api','How do you like to dress?  \nDo kids who identify as boys have to dress a certain way?  Why do you think people believe that? \nDo kids who identify as girls have to dress a certain way?  Why do you think people believe that? \nWhat if a kid doesn\'t identify as a boy or girl?  How do they decide what to wear?\nHow does it feel to be able to dress in a way that feels good to you?','1785927287','2016-12-21','https://www.youtube.com/watch?v=HgV_M4n4PYc','2020-07-14 20:59:33','2020-07-14 21:02:59','1'},
{'23','The Gender Wheel','A Story about Bodies and Gender for Every Body','Maya Christina Gonzalez ','','Award-winning author and illustrator of My Colors, My World and Call Me Tree, Maya Gonzalez, shares a nature-based, inclusive, body positive story of gender. Inviting every body back to the circle. By providing an integrated foundation to talk to kids about gender, The Gender Wheel expands our thinking as we remember that we ALL belong.','http://books.google.com/books/content?id=rVLtswEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api','','1945289057','2017-11-20','https://www.youtube.com/watch?v=8f_qs6V5jig','2020-07-14 20:59:58','2020-07-14 21:03:16','1'},
{'24','Julián Is a Mermaid','','Jessica Love','','In an exuberant picture book, a glimpse of costumed mermaids leaves one boy flooded with wonder and ready to dazzle the world. While riding the subway home from the pool with his abuela one day, Julián notices three women spectacularly dressed up. Their hair billows in brilliant hues, their dresses end in fishtails, and their joy fills the train car. When Julián gets home, daydreaming of the magic he\'s seen, all he can think about is dressing up just like the ladies in his own fabulous mermaid costume: a butter-yellow curtain for his tail, the fronds of a potted fern for his headdress. But what will Abuela think about the mess he makes -- and even more importantly, what will she think about how Julián sees himself? Mesmerizing and full of heart, Jessica Love\'s author-illustrator debut is a jubilant picture of self-love and a radiant celebration of individuality.','http://books.google.com/books/content?id=-LNKDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api','','763690458','2018-04-23','https://www.youtube.com/watch?v=okk46rxHiM4','2020-07-14 21:00:56','2020-07-14 21:01:42','1'},
{'26','Young Gifted and Black','Meet 52 Black Heroes from Past and Present','Jamia Wilson','Andrea Pippins','“...to be revisited again and again…The candy-colored pages and straightforward stories are hard to resist…” –The New York Times “...diverse collection of iconic figures…vibrantly illustrated…beautifully crafted volume…” –Kirkus Reviews, Starred Review “…exuberant…exquisitely designed…a launching point for more discoveries.” –School Library Journal, Starred Review “A luminous and diverse tribute to black movers and shakers across the centuries.” –Publishers Weekly Meet 52 icons of colour from the past and present in this celebration of inspirational achievement – a collection of stories about changemakers to encourage, inspire and empower the next generation of changemakers. Jamia Wilson has carefully curated this range of black icons and the book is stylishly brought together by Andrea Pippins’ colourful and celebratory illustrations. Written in the spirit of Nina Simone’s song “To Be Young, Gifted, and Black,” this vibrant book is a perfect introduction to both historic and present-day icons and heroes. Meet figureheads, leaders and pioneers such as Martin Luther King Jr., Nelson Mandela and Rosa Parks, as well as cultural trailblazers and athletes like Stevie Wonder, Oprah Winfrey and Serena Williams. All children deserve to see themselves represented positively in the books they read. Highlighting the talent and contributions of black leaders and changemakers from around the world, readers of all backgrounds will be empowered to discover what they too can achieve. Strong, courageous, talented and diverse, these extraordinary men and women\'s achievements will inspire a new generation to chase their dream… whatever it may be. The 52 icons: Mary Seacole, Matthew Henson, Ava Duvernay, Bessie Coleman, Barack Obama, Michelle Obama, Chimamanda Ngozi Adichie, Cathy Freeman, George Washington Carver, Malorie Blackman, Harriet Tubman, Mo Farah, Jean-Michel Basquiat, Jesse Owens, Beyonce Knowles, Solange Knowles, Katherine Johnson, Josephine Baker, Kofi Annan, Langston Hughes, Toni Morrison, Brian Lara, Madam C.J. Walker, Yannick Noah, Maurice Ashley, Alexandre Duma, Martin Luther King, Jr., Maya Angelou, Nina Simone, Simone Biles, Stevie Wonder, Esperanza Spalding, Sidney Poitier, Oprah Winfrey, Pele, Nelson Mandela, Louis Armstrong, Rosa Parks, Naomi Campbell, Samuel Coleridge-Taylor, Muhammad Ali, Shirley Chisholm, Steve McQueen, Zadie Smith, Usain Bolt, Wangari Maathai, Mae Jemison, W.E.B. Du Bois, Nicola Adams, Serena Williams, Venus Williams, and Misty Copeland. If you like this book, check out Step Into Your Power and Big Ideas for Young Thinkers, by the same author-illustrator team.','http://books.google.com/books/content?id=k8tjDwAAQBAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api','','1786039835','2018-02-01','https://www.youtube.com/watch?v=npLgvYFx32g','2020-07-14 21:07:31','2020-07-14 21:15:52','1'},
{'27','Superheroes Are Everywhere','','Kamala Harris','Mechal Renee Roe','\"Senator Kamala Harris\'s picture book memoir in which she tells her life story and shows how everyone can be a superhero\"--','http://books.google.com/books/content?id=brmHDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api','','1984837493','2019-01-08','https://www.youtube.com/watch?v=YVdHDkQ3QQk','2020-07-14 21:08:45','2020-07-14 21:14:45','1'},
{'28','Our Children Can Soar','A Celebration of Rosa, Barack, and the Pioneers of Change','Michelle Cook','Leo Dillon','This unique picture book is part history, part poetry, and entirely inspirational. It takes the reader step by simple step through the cumulative story of the US Civil Rights Movement, showing how select pioneers\' achievements led up to the landmark moment when we elected our first black president. Each historical figure is rendered by a different award-winning illustrator, highlighting the singular and vibrant contribution that each figure made.','http://books.google.com/books/content?id=UgQGfAEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api','','1599907833','2012-01-03','https://www.youtube.com/watch?v=MxqPODbEThs','2020-07-14 21:12:23','2020-07-14 21:15:42','1'},
{'29','A Child\'s Introduction to African American History','The Experiences, People, and Events That Shaped Our Country','Jabari Asim','Lynn Gaines ','A comprehensive, entertaining look at heroes, heroines, and critical moments from African American history -- from the slave trade to the Black Lives Matter movement --by award-winning author Jabari Asim. Jabari Asim goes beyond what\'s taught in the classroom to reveal a fact-filled history of African American history through politics, activism, sports, entertainment, music, and much more. You\'ll follow the road to freedom beginning with the slave trade and the middle passage through the abolitionist movement and the Civil War where many African Americans fought as soldiers. You\'ll learn how slave songs often contained hidden messages and how a 15-year-old Jamaican-born young man named Clive Campbell helped to create hip-hop in the early 1970\'s. You\'ll experience the passionate speeches, marches, and movements of the Civil Rights era along with and the sacrifices of Martin Luther King, Rosa Parks, Medgar Evers, and many others. Along the way there are dozens of profiles of political trailblazers like Shirley Chisholm, the first black women elected to Congress in 1968; dominants athletes like Tiger Woods who, in 1995, was only the second African American to play in a Master\'s Golf Tournament which he went on to win in 1997; popular musicians like Miles Davis, one the most influential artists of the twentieth century; and inspiring writers like Toni Morrison, the first African American to win the Nobel Prize in literature. Filled with beautiful illustrations by Lynn Gaines that bring these figures and events to life, plus a removable historical timeline poster, A Child\'s Introduction to African American History is a fascinating and comprehensive guide to this often overlooked yet immensely important part of American history.','http://books.google.com/books/content?id=CUreDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api','','316436427','2018-01-02','','2020-07-14 21:12:55','2020-07-14 21:15:33','1'},
{'30','Preaching to the Chickens','The Story of Young John Lewis','Jabari Asim','E. B. Lewis ','\"John wants to be a preacher when he grows up-a leader whose words stir hearts to change, minds to think, and bodies to take action. But why wait? When John is put in charge of the family farm\'s flock of chickens, he discovers that they make a wonderful congregation! So he preaches to his flock, and they listen, content under his watchful care, riveted by the rhythm of his voice. Celebrating ingenuity and dreaming big, this inspirational story, featuring Jabari Asim\'s stirring prose and E. B. Lewis\'s stunning, light-filled impressionistic watercolor paintings, includes an author\'s note about John Lewis, who grew up to be a member of the Freedom Riders, chairman of the Student Nonviolent Coordinating Committee, and demonstrator on the Edmund Pettus Bridge in Selma, Alabama. John Lewis is now a Georgia congressman, who is still an activist today, recently holding a sit-in on the House floor of the U.S. Capitol to try to force a vote on gun violence.\"','http://books.google.com/books/content?id=LmUGDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api','','399168567','2016-10-11','https://www.youtube.com/watch?v=8zMqq1roTmY','2020-07-14 21:13:50','2020-07-14 21:15:23','1'},
{'31','Malcolm Little','The Boy Who Grew Up to Become Malcolm X','Ilyasah Shabazz','AG Ford','An inspiring picture book profile of the iconic civil rights leader\'s childhood, written by his daughter, describes how young Malcolm\'s optimism and faith were challenged by intolerance and a series of tragedies that compelled him to learn self-reliance and how to embrace his individuality to reach his highest potential.','http://books.google.com/books/content?id=N7PDBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api','','1442412163','2014-01-07','https://www.youtube.com/watch?v=tW35N5grdz4','2020-07-14 21:14:30','2020-07-14 21:15:06','1'},
{'32','We Rise, We Resist, We Raise Our Voices','','Wade Hudson ','','Fifty of the foremost diverse children\'s authors and illustrators--including Jason Reynolds, Jacqueline Woodson, and Kwame Alexander--share answers to the question, \"In this divisive world, what shall we tell our children?\" in this beautiful, full-color keepsake collection, published in partnership with Just Us Books. What do we tell our children when the world seems bleak, and prejudice and racism run rampant? With 96 lavishly designed pages of original art and prose, fifty diverse creators lend voice to young activists. Featuring poems, letters, personal essays, art, and other works from such industry leaders as Jacqueline Woodson (Brown Girl Dreaming), Jason Reynolds (All American Boys), Kwame Alexander (The Crossover), Andrea Pippins (I Love My Hair), Sharon Draper (Out of My Mind), Rita Williams-Garcia (One Crazy Summer), Ellen Oh (cofounder of We Need Diverse Books), and artists Ekua Holmes, Rafael Lopez, James Ransome, Javaka Steptoe, and more, this anthology empowers the nation\'s youth to listen, learn, and build a better tomorrow.','http://books.google.com/books/content?id=0rtFDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api','','525580423','2018-09-04','https://www.youtube.com/watch?v=j5RQxrmM8Yk','2020-07-14 21:19:21','2020-07-14 21:27:07','1'},
{'33','Woke Baby','','Mahogany L. Browne','Theodore Taylor III','For all the littlest progressives, waking up to seize a new day of justice and activism. Woke babies are up early. Woke babies raise their fists in the air. Woke babies cry out for justice. Woke babies grow up to change the world. This lyrical and empowering book is both a celebration of what it means to be a baby and what it means to be woke. With bright playful art, Woke Baby is an anthem of hope in a world where the only limit to a skyscrapper is more blue.','http://books.google.com/books/content?id=Dlt-DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api','','1250308986','2018-12-31','https://www.youtube.com/watch?v=q-KCOubqBi4','2020-07-14 21:20:36','2020-07-14 21:27:27','1'},
{'35','An ABC of Equality','','Chana Ginelle Ewing','Paulina Morgan','A is for Ability, B is for Belief, C is for Class. All people have the right to be treated fairly, no matter who they are, what they look like, or where they come from. An ABC of Equality introduces complicated concepts surrounding social justice to the youngest of children. From A to Z, simple explanations accompanied by engaging artwork teach children about the world we live in and how to navigate our way through it. Each right-hand page includes a brightly decorated letter with the word it stands for and an encouraging slogan. On the left, a colorful illustration and bite-size text sum up the concept. Cheerful people from a range of backgrounds, ethnicities, and abilities lead the way through the alphabet. L is for LGBTQIA. Find the words that make you, you. N is for No. No means no. P is for Privilege. Be aware of your advantages. X is for Xenophobia. Ask questions and you\'ll see there\'s nothing to be afraid of. Celebrate your Differences, ask more Questions, share your Kindness, and learn to Understand the world.','http://books.google.com/books/content?id=K2KmDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api','','1786037428','2019-09-03','https://www.youtube.com/watch?v=LevmefTSsU0','2020-07-14 21:21:36','2020-07-14 21:27:56','1'},
{'36','When a Bully is President','Truth and Creativity for Oppressive Times','Maya Gonzalez','','A tool to talk about current and historical oppression and bullying in the United States while focusing on the important role kids can play using creativity and self love as a base to develop strength during difficult times.','http://books.google.com/books/content?id=NSfXswEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api','','1945289088','2017-09-04','https://vimeo.com/200327255','2020-07-14 21:22:05','2020-07-14 21:22:05','0'},
{'37','I\'m Gonna Push Through!','','Jasmyn Wright','Shannon Wright','Based on the Push Through movement that inspires kids worldwide, this is an empowering, energetic, and all-inclusive picture book that celebrates resilience in the face of adversity. Hold your head high. No matter what stands in the way of your dreams, remember this: YOU can push through anything! If someone tells you it’s too hard, don’t you ever listen. You tell them, “I’m gonna push through!” Inspired by a mantra written for her third-grade students, Jasmyn Wright’s uplifting call to “push through” is an invitation to young readers to announce their own power and to recognize and reaffirm that of others, regardless of setbacks. Her empowering words not only lift children up, but show them how to lift themselves up and seize their potential.','http://books.google.com/books/content?id=EHbLDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api','','1534439658','2020-02-18','https://www.youtube.com/watch?v=y19S8Zayl70','2020-07-14 21:22:34','2020-07-14 21:34:15','1'},
{'38','I Have a Dream','','Dr. Martin Luther King Jr.','Kadir Nelson','Presents the text of the famous speech given on the National Mall in Washington, D.C. by Martin Luther King, Jr., complemented by paintings illustrating the ideals the civil rights leader described.','http://books.google.com/books/content?id=YTS4yIhstAEC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api','','375858871','2012-10-09','https://www.youtube.com/watch?v=R-dAi5LE5Ts','2020-07-14 21:23:31','2020-07-15 00:39:23','1'},
{'39','Be a King','Dr. Martin Luther King Jr.’s Dream and You','Carole Boston Weatherford','James E. Ransome','You can be a King. Stamp out hatred. Put your foot down and walk tall. You can be a King. Beat the drum for justice. March to your own conscience. Featuring a dual narrative of the key moments of Dr. King\'s life alongside a modern class as the students learn about him, Carole Weatherford\'s poetic text encapsulates the moments that readers today can reenact in their own lives. See a class of young students as they begin a school project inspired by Dr. Martin Luther King Jr. and learn to follow his example, as he dealt with adversity and never lost hope that a future of equality and justice would soon be a reality. As times change, Dr. King\'s example remains, encouraging a new generation of children to take charge and change the world . . . to be a King.','http://books.google.com/books/content?id=l7dDDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api','','802723680','2018-01-02','https://www.youtube.com/watch?v=d6XJwKzWwV4','2020-07-14 21:24:19','2020-07-14 21:36:46','1'},
]